Клубный_рейтинг_РАЗРАБОТКА/src/Catalogs/ДополнительныеОтчетыИОбработки/ДополнительныеОтчетыИОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДополнительныеОтчетыИОбработки</name>
  <attributes>
    <name>ХранилищеВнешнейОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКФайлуИсточнику</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидФайла</name>
    <type>
      <types>EnumRef.ВидыФайлов</types>
    </type>
  </attributes>
</mdclass:Catalog>

Клубный_рейтинг_РАЗРАБОТКА/src/Enums/ВидыФайлов/ВидыФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыФайлов</name>
  <enumValues>
    <name>Отчет</name>
  </enumValues>
  <enumValues>
    <name>Обработка</name>
  </enumValues>
</mdclass:Enum>

Клубный_рейтинг_РАЗРАБОТКА/src/Catalogs/ДополнительныеОтчетыИОбработки/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура КомандаЗагрузить(Команда)
	
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("КомандаЗагрузитьЗавершение1", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьЗавершение1(Подключено, ДополнительныеПараметры) Экспорт
	
	Если Подключено Тогда
		
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогОткрытияФайла.Фильтр = "Все файлы|*.epf;*.erf|Внешние обработки|*.epf|Внешние отчеты|*.erf";
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите файл'");
		
		ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("КомандаЗагрузитьЗавершение", ЭтотОбъект, Новый Структура("ДиалогОткрытияФайла", ДиалогОткрытияФайла)));
	Иначе
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьЗавершение(ВыбранныеФайлы1, ДополнительныеПараметры) Экспорт
	
	ДиалогОткрытияФайла = ДополнительныеПараметры.ДиалогОткрытияФайла;
	
	
	Если (ВыбранныеФайлы1 <> Неопределено) Тогда
		ВыбранныеФайлы = ДиалогОткрытияФайла.ВыбранныеФайлы;
		СоздатьВнешниеОтчетыИОбработки(ВыбранныеФайлы);
		Если ВыбранныеФайлы.Количество() > 1 Тогда
			Текст = "Файлы успешно загружены";
		Иначе
			Текст = "Файл успешно загружен";
		КонецЕсли;
		ПоказатьОповещениеПользователя("Внимание",,Текст,БиблиотекаКартинок.Информация);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СоздатьВнешниеОтчетыИОбработки(МассивФайлов)
	
	Для Каждого ТекФайл Из МассивФайлов Цикл
		Файл = Новый Файл(ТекФайл);
		КомментарийКФайлу = Файл.Имя + Символы.ПС + "размер:" + Файл.Размер()+" байт; изменен:" + Файл.ПолучитьВремяИзменения() + "; сохранен в ИБ:" + ТекущаяДата();
		ДвоичныеДанные = Новый ДвоичныеДанные(ТекФайл);
		Если Файл.Расширение = ".epf" Тогда //обработка
			ВидФайла = Перечисления.ВидыФайлов.Обработка;
			ВТ = ВнешниеОбработки.Создать(ТекФайл,Ложь);
			ЗаголовокФайла = Вт.Метаданные().Синоним;
		Иначе //внешний отчет
			ВидФайла = Перечисления.ВидыФайлов.Отчет;
			ВТ = ВнешниеОтчеты.Создать(ТекФайл,Ложь);
			ЗаголовокФайла = Вт.Метаданные().Синоним;
		КонецЕсли;
		
		НовЭлемент = Объект.Ссылка.ПолучитьОбъект();
		НовЭлемент.Наименование = ЗаголовокФайла;
		НовЭлемент.ВидФайла = 	ВидФайла;
		НовЭлемент.КомментарийКФайлуИсточнику = КомментарийКФайлу;
		НовЭлемент.ХранилищеВнешнейОбработки = Новый ХранилищеЗначения(ДвоичныеДанные,Новый СжатиеДанных(8));
		НовЭлемент.Записать();
	КонецЦикла;
	
КонецПроцедуры
